src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Catalogs/УЗ_Кассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_Кассы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/Catalogs/УЗ_СтавкиПедагогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_СтавкиПедагогов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаЗаЗанятие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаСЧеловека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаЗаЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСОплатыУченика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/Catalogs/УЗ_ФизЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_ФизЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Фото</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Http</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоТелефону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель1Прежний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Составной тип: пустое значение (Неопределено) — пол не указан; Булево пустым не бывает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВыбранныеГруппыОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПедагог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выбыл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредпочитаемыйКанал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСогласия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Плательщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КемПриходится</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/Catalogs/УЗ_Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_Тарифы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИсториюЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/CommonModules/УЗ_Общий/Ext/Module.bsl
//Общие серверные функции «Учёта занятий»: чтение реквизитов объектов хозяина
//без заимствования реквизитов (заимствованный реквизит с чужим типом отключает
//всё расширение при обновлении конфигурации покупателя).

//Есть ли у объекта метаданных реквизит (свой или стандартный).
//  ПолноеИмя — "Справочник.Организации"; ИмяРеквизита — "ИНН".
Функция ЕстьРеквизит(ПолноеИмя, ИмяРеквизита) Экспорт

	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	//у коллекции стандартных реквизитов нет метода Найти
	Для Каждого Стандартный Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
		Если Стандартный.Имя = ИмяРеквизита Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

//Значение реквизита ссылки; если реквизита у хозяина нет или ссылка пуста —
//ЗначениеПоУмолчанию. Читается запросом, а не через ссылку: ссылка кэширует реквизиты.
Функция ЗначениеРеквизита(Ссылка, ИмяРеквизита, ЗначениеПоУмолчанию = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	ПолноеИмя = Ссылка.Метаданные().ПолноеИмя();
	Если Не ЕстьРеквизит(ПолноеИмя, ИмяРеквизита) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таблица.%1 КАК Значение
	|ИЗ
	|	%2 КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка", ИмяРеквизита, ПолноеИмя);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	Возврат ЗначениеПоУмолчанию;

КонецФункции

//Ошибка, перехваченная в ветке Исключение: подробности — в журнал регистрации
//(событие «Учёт занятий.<Событие>»), краткий текст — пользователю (если Сообщать).
//  Событие — где случилось ("Абонемент.Оплаты"); Информация — ИнформацияОбОшибке();
//  Пояснение — что не получилось, для пользователя ("Не удалось посчитать оплаты").
Процедура ЗаписатьОшибку(Событие, Информация, Пояснение = "", Сообщать = Истина) Экспорт

	ЗаписьЖурналаРегистрации(НСтр("ru = 'Учёт занятий'") + "." + Событие, УровеньЖурналаРегистрации.Ошибка,
		, , ПодробноеПредставлениеОшибки(Информация));
	Если Сообщать Тогда
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(
			?(ПустаяСтрока(Пояснение), "", Пояснение + ": ") + КраткоеПредставлениеОшибки(Информация));
	КонецЕсли;

КонецПроцедуры

//Запись урока по решению В10 (как в типовых): урок нельзя провести раньше его начала.
//  Урок — ДокументОбъект.УЗ_Урок; Провести — Истина: проводить, но урок, который ещё не начался,
//  только записывается (проведённый ранее — с отменой проведения); Ложь — обычная запись.
//  Уже проведённый урок всегда перепроводится, даже при Провести = Ложь (Codex A01): обычная запись
//  проведённого урока меняла документ (добавленный ученик, сумма), а движения оставались прежними.
//Возврат — Структура: Успех; Пометка — «записан без проведения: …» или ""; Текст — почему не записан:
//сообщения проведения (пересечение педагога/помещения, закрытый период, нет цены) или текст ошибки.
Функция ЗаписатьУрок(Урок, Провести) Экспорт

	Итог = Новый Структура("Успех, Пометка, Текст", Истина, "", "");
	Если Не Провести И Не Урок.Проведен Тогда
		Режим = РежимЗаписиДокумента.Запись;
	ИначеЕсли Урок.Дата <= ТекущаяДатаСеанса() Тогда
		Режим = РежимЗаписиДокумента.Проведение;
	Иначе
		Режим = ?(Урок.Проведен, РежимЗаписиДокумента.ОтменаПроведения, РежимЗаписиДокумента.Запись);
		Итог.Пометка = НСтр("ru = 'записан без проведения: урок ещё не начался, проведите его после начала'");
	КонецЕсли;

	Попытка
		Урок.Записать(Режим);
	Исключение
		Информация = ИнформацияОбОшибке();
		//отказ проведения платформа сообщает общей фразой, причины — в сообщениях обработки проведения
		Причины = Новый Массив;
		Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
			Причины.Добавить(Сообщение.Текст);
		КонецЦикла;
		Если Причины.Количество() = 0 Тогда
			Причины.Добавить(КраткоеПредставлениеОшибки(Информация));
		КонецЕсли;
		Итог.Успех = Ложь;
		Итог.Пометка = "";
		Итог.Текст = СтрСоединить(Причины, "; ");
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Учёт занятий'") + ".ЗаписьУрока", УровеньЖурналаРегистрации.Предупреждение,
			Урок.Метаданные(), Урок.Ссылка, ПодробноеПредставлениеОшибки(Информация));
	КонецПопытки;
	Возврат Итог;

КонецФункции

//Действует ли безопасный режим (расширение загружено из файла — 1С включает его сама,
//или профиль безопасности). В нём не работают привилегированный режим и ИнтернетПочта.
//Спрашивать каждый раз: режим — величина момента, кэшировать нельзя.
Функция БезопасныйРежимДействует() Экспорт

	Возврат БезопасныйРежим() <> Ложь;

КонецФункции

//Готовый текст для пользователя: что сделать администратору, чтобы снять безопасный режим.
Функция КакСнятьБезопасныйРежим() Экспорт

	Возврат НСтр("ru = 'У расширения «Учёт занятий» включён безопасный режим. Администратору: Администрирование — Печатные формы, отчёты и обработки — Расширения — выбрать «Учёт занятий» — снять флажок «Безопасный режим», затем перезапустить программу.'");

КонецФункции

#Область ДлительныеОперации

//Длительная операция без БСП (аналог ДлительныеОперации; архитектор, 2.3, 28.09.2026): процедура общего модуля
//выполняется фоновым заданием, форма не ждёт её, а раз в секунду спрашивает СостояниеДлительнойОперации. Результат
//задание кладёт во временное хранилище формы (АдресРезультата — последний параметр процедуры).
//  Песочница почты сеанса передаётся заданию первым параметром процедуры: у фонового сеанса свои параметры сеанса,
//  без этого тест на копии базы отправил бы из задания настоящее письмо (N05).
//  Не удалось запустить фоновое задание — Неопределено: вызывающий выполняет операцию сам (синхронно).
//Структура: Задание (УникальныйИдентификатор), АдресРезультата.
Функция ЗапуститьФоновоеЗадание(ИмяМетода, ПараметрыМетода, ИдентификаторФормы, Наименование) Экспорт

	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, ИдентификаторФормы);
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(УЗ_Почта.ПесочницаВключена());
	Для Каждого Параметр Из ПараметрыМетода Цикл
		ПараметрыЗадания.Добавить(Параметр);
	КонецЦикла;
	ПараметрыЗадания.Добавить(АдресРезультата);
	Попытка
		Задание = ФоновыеЗадания.Выполнить(ИмяМетода, ПараметрыЗадания, , Наименование);
	Исключение
		ЗаписатьОшибку(НСтр("ru = 'Учёт занятий.Фоновое задание'"), ИнформацияОбОшибке(),
			СтрШаблон(НСтр("ru = 'Не удалось запустить фоновое задание «%1» — выполняется без него'"), Наименование), Ложь);
		Возврат Неопределено;
	КонецПопытки;
	Возврат Новый Структура("Задание, АдресРезультата", Задание.УникальныйИдентификатор, АдресРезультата);

КонецФункции

//Начало фонового задания: песочница почты вызвавшего сеанса (см. ЗапуститьФоновоеЗадание).
Процедура ПриНачалеФоновогоЗадания(Песочница) Экспорт

	Если Песочница = Истина И Не УЗ_Почта.ПесочницаВключена() Тогда
		УЗ_Почта.ВключитьПесочницу();
	КонецЕсли;

КонецПроцедуры

//Состояние фонового задания для формы. Структура: Завершено (Булево), Результат (из временного хранилища,
//когда задание завершилось), Ошибка (строка: задание упало, отменено или не найдено).
Функция СостояниеДлительнойОперации(Задание, АдресРезультата) Экспорт

	Состояние = Новый Структура("Завершено, Результат, Ошибка", Истина, Неопределено, "");
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Задание);
	Если ФоновоеЗадание = Неопределено Тогда
		Состояние.Ошибка = НСтр("ru = 'Фоновое задание не найдено (сеанс перезапущен?). Повторите действие.'");
	ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Состояние.Завершено = Ложь;
	ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		Состояние.Ошибка = ?(ФоновоеЗадание.ИнформацияОбОшибке = Неопределено, НСтр("ru = 'Фоновое задание завершилось с ошибкой.'"),
			КраткоеПредставлениеОшибки(ФоновоеЗадание.ИнформацияОбОшибке));
	ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		Состояние.Ошибка = НСтр("ru = 'Фоновое задание отменено.'");
	Иначе
		Состояние.Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	КонецЕсли;
	Возврат Состояние;

КонецФункции

#КонецОбласти

//Видна ли пользователю зарплата педагогов: ставки, начисления в уроке, расчёт и выплата зарплаты.
//Да — у роли «Учёт занятий: руководитель» (УЗ_Руководитель) и у «Полных прав» хозяина; у менеджера
//(УЗ_ОсновнаяРоль) права на расчёт зарплаты нет — формы прячут у него зарплатные поля.
Функция ДоступнаЗарплата() Экспорт

	Возврат ПравоДоступа("Изменение", Метаданные.Документы.УЗ_РасчетЗарплаты);

КонецФункции

//Остаток денег со знаком и цветом по палитре (docs\визуал\дизайнер.md, раздел 3): плюс — «+1 800,00» цветом
//плюса (переплата, аванс), минус — «-800,00» цветом минуса (долг); ноль платформа показывает пустым.
//  УсловноеОформление — формы или динамического списка;
//  ИменаЭлементов — имя элемента формы (колонки) или массив имён;
//  ПутьКДанным — поле отбора: «Объект.Ученики.ЗадолженностьПоПредмету» (форма) или «Остаток» (динамический список).
Процедура ОформитьОстатокДенег(УсловноеОформление, ИменаЭлементов, ПутьКДанным) Экспорт

	Имена = ?(ТипЗнч(ИменаЭлементов) = Тип("Массив"), ИменаЭлементов, СтрРазделить(ИменаЭлементов, ",", Ложь));
	Варианты = Новый Массив;
	Варианты.Добавить(Новый Структура("Сравнение, Цвет, Формат", ВидСравненияКомпоновкиДанных.Больше,
		УЗ_ОбщийКлиентСервер.ЦветПлюсаДенег(), "ЧДЦ=2; ЧФ=+Ч"));
	Варианты.Добавить(Новый Структура("Сравнение, Цвет, Формат", ВидСравненияКомпоновкиДанных.Меньше,
		УЗ_ОбщийКлиентСервер.ЦветМинусаДенег(), "ЧДЦ=2"));

	Для Каждого Вариант Из Варианты Цикл
		Элемент = УсловноеОформление.Элементы.Добавить();
		Для Каждого Имя Из Имена Цикл
			Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(СокрЛП(Имя));
		КонецЦикла;
		Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКДанным);
		Отбор.ВидСравнения = Вариант.Сравнение;
		Отбор.ПравоеЗначение = 0;
		Если Вариант.Цвет <> Неопределено Тогда
			Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Вариант.Цвет);
		КонецЕсли;
		Элемент.Оформление.УстановитьЗначениеПараметра("Формат", Вариант.Формат);
	КонецЦикла;

КонецПроцедуры

//Для динамических списков (событие таблицы ПриПолученииДанныхНаСервере): поле-строка «ч:мм» из числа часов.
//В запросе списка поле-строка объявлено как ВЫРАЗИТЬ("" КАК СТРОКА(10)), число часов — обязательное поле списка
//(УстановитьОбязательноеИспользование), иначе без своей колонки на форме его нет в данных строки.
Процедура ЗаполнитьЧасыМинуты(Строки, ИмяЧасов = "КоличествоЧасов", ИмяТекста = "ЧасыТекстом") Экспорт

	Для Каждого КлючИСтрока Из Строки Цикл
		Данные = КлючИСтрока.Значение.Данные;
		Данные[ИмяТекста] = УЗ_ОбщийКлиентСервер.ЧасыМинуты(Данные[ИмяЧасов], Истина);
	КонецЦикла;

КонецПроцедуры

#Область ПервыйЗапуск

//Помощник первого запуска (общая форма УЗ_ПервыйЗапуск; тест tools\тесты\тест_первый_запуск.py): связанный набор
//для первого урока — касса организации, предметы, педагоги со ставкой, тарифы, группа с расписанием, ученики —
//и настройки учёта (организация, касса). Каждый объект ищется по наименованию: повторный вызов (шаг «Далее»
//помощника, второй запуск помощника) берёт найденный и ничего не дублирует; у найденного дописываются только
//пустые поля (цены, расписание и ставки уже заведённых объектов помощник не меняет).
//  Данные — структура, ключи необязательны, пустые значения пропускаются:
//    Организация — СправочникСсылка.Организации хозяина; Касса — наименование кассы;
//    Предметы — строка, предметы через запятую или с новой строки;
//    Педагоги — массив структур ФИО, ЗаЗанятие, ЗаЧас (ставка: оплата за занятие или за час);
//    ЦенаЗанятия — тариф «Разовое занятие»; АбонементЗанятий и ЦенаАбонемента — тариф «Абонемент N занятий»;
//    Группа — наименование группы; ДниНедели — коды через запятую («ПН,СР»); ВремяНачала, Продолжительность — время;
//    Ученики — массив структур ФИО, Телефон, Родитель (ФИО родителя).
//Итог — структура: Организация, Касса, Предметы (массив), Педагоги (массив), ТарифЗанятия, ТарифАбонемента, Группа,
//Ученики (массив); Журнал — массив строк «Создано…» / «Уже есть…»; Создано — сколько объектов создано этим вызовом.
//Всё в одной транзакции: ошибка записи любого объекта — исключение, ничего не записано.
Функция ВыполнитьПервуюНастройку(Данные) Экспорт

	Итог = Новый Структура("Организация, Касса, Предметы, Педагоги, ТарифЗанятия, ТарифАбонемента, Группа, Ученики, Журнал, Создано");
	Итог.Предметы = Новый Массив;
	Итог.Педагоги = Новый Массив;
	Итог.Ученики = Новый Массив;
	Итог.Журнал = Новый Массив;
	Итог.Создано = 0;

	НачатьТранзакцию();
	Попытка
		ПерваяНастройкаКасса(Данные, Итог);
		ПерваяНастройкаПредметы(Данные, Итог);
		ПерваяНастройкаПедагоги(Данные, Итог);
		ПерваяНастройкаТарифы(Данные, Итог);
		ПерваяНастройкаГруппа(Данные, Итог);
		ПерваяНастройкаУченики(Данные, Итог);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	Возврат Итог;

КонецФункции

//Значение ключа структуры данных помощника; нет ключа или значение пустое — ПоУмолчанию.
Функция ЗначениеПервойНастройки(Данные, Ключ, ПоУмолчанию = Неопределено)

	Значение = Неопределено;
	Если Данные.Свойство(Ключ, Значение) И ЗначениеЗаполнено(Значение) Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат ПоУмолчанию;

КонецФункции

//Элемент справочника (не папка, не помеченный на удаление) с таким наименованием; нет — Неопределено.
//  ЭтоПедагог — только для людей (УЗ_ФизЛица): Истина — педагог, Ложь — ученик/родитель, Неопределено — любой.
Функция НайтиПоНаименованиюПервойНастройки(Менеджер, Наименование, ЭтоПедагог = Неопределено)

	Выборка = Менеджер.Выбрать(, , Новый Структура("Наименование", Наименование));
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Или Выборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Если ЭтоПедагог <> Неопределено И Выборка.ЭтоПедагог <> ЭтоПедагог Тогда
			Продолжить;
		КонецЕсли;
		Возврат Выборка.Ссылка;
	КонецЦикла;
	Возврат Неопределено;

КонецФункции

Процедура ОтметитьПервуюНастройку(Итог, Создан, Вид, Наименование)

	Если Создан Тогда
		Итог.Создано = Итог.Создано + 1;
		Итог.Журнал.Добавить(СтрШаблон(НСтр("ru = 'Создано: %1 «%2»'"), Вид, Наименование));
	Иначе
		Итог.Журнал.Добавить(СтрШаблон(НСтр("ru = 'Уже есть: %1 «%2»'"), Вид, Наименование));
	КонецЕсли;

КонецПроцедуры

//Касса организации и настройки учёта (организация, касса — ими заполняются новые документы).
Процедура ПерваяНастройкаКасса(Данные, Итог)

	Организация = ЗначениеПервойНастройки(Данные, "Организация");
	ИмяКассы = Лев(СокрЛП(ЗначениеПервойНастройки(Данные, "Касса", "")), 25);
	Итог.Организация = Организация;
	Если ЗначениеЗаполнено(ИмяКассы) Тогда
		Касса = НайтиПоНаименованиюПервойНастройки(Справочники.УЗ_Кассы, ИмяКассы);
		Создан = (Касса = Неопределено);
		Если Создан Или (ЗначениеЗаполнено(Организация) И Не ЗначениеЗаполнено(Касса.Организация)) Тогда
			КассаОбъект = ?(Создан, Справочники.УЗ_Кассы.СоздатьЭлемент(), Касса.ПолучитьОбъект());
			КассаОбъект.Наименование = ИмяКассы;
			КассаОбъект.Организация = Организация;
			Если Создан Тогда
				Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	Кассы.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.УЗ_Кассы КАК Кассы
				|ГДЕ
				|	Кассы.Основная
				|	И НЕ Кассы.ПометкаУдаления");
				КассаОбъект.Основная = Запрос.Выполнить().Пустой();
			КонецЕсли;
			КассаОбъект.Записать();
			Касса = КассаОбъект.Ссылка;
		КонецЕсли;
		Итог.Касса = Касса;
		ОтметитьПервуюНастройку(Итог, Создан, НСтр("ru = 'касса'"), ИмяКассы);
	КонецЕсли;

	Значения = Новый Структура;
	Настройки = РегистрыСведений.УЗ_Настройки.Настройки();
	Если ЗначениеЗаполнено(Организация) И Настройки.Организация <> Организация Тогда
		Значения.Вставить("Организация", Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Итог.Касса) И Настройки.Касса <> Итог.Касса Тогда
		Значения.Вставить("Касса", Итог.Касса);
	КонецЕсли;
	Если Значения.Количество() > 0 Тогда
		РегистрыСведений.УЗ_Настройки.ЗаписатьНастройки(Значения);
		Итог.Журнал.Добавить(НСтр("ru = 'Записано: настройки учёта — организация и касса для новых документов'"));
	КонецЕсли;

КонецПроцедуры

Процедура ПерваяНастройкаПредметы(Данные, Итог)

	Текст = СтрЗаменить(ЗначениеПервойНастройки(Данные, "Предметы", ""), Символы.ПС, ",");
	Для Каждого ИмяПредмета Из СтрРазделить(Текст, ",;", Ложь) Цикл
		ИмяПредмета = Лев(СокрЛП(ИмяПредмета), 25);
		Если ИмяПредмета = "" Тогда
			Продолжить;
		КонецЕсли;
		Предмет = НайтиПоНаименованиюПервойНастройки(Справочники.УЗ_ПредметыОбучения, ИмяПредмета);
		Создан = (Предмет = Неопределено);
		Если Создан Тогда
			ПредметОбъект = Справочники.УЗ_ПредметыОбучения.СоздатьЭлемент();
			ПредметОбъект.Наименование = ИмяПредмета;
			ПредметОбъект.Записать();
			Предмет = ПредметОбъект.Ссылка;
		КонецЕсли;
		Если Итог.Предметы.Найти(Предмет) = Неопределено Тогда
			Итог.Предметы.Добавить(Предмет);
			ОтметитьПервуюНастройку(Итог, Создан, НСтр("ru = 'предмет'"), ИмяПредмета);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

//Ставка педагога по сумме: «500 за занятие» или «600 за час» — одна на всех педагогов с такой оплатой.
Функция СтавкаПервойНастройки(ЗаЗанятие, ЗаЧас, Итог)

	Если ЗаЗанятие > 0 Тогда
		ИмяСтавки = СтрШаблон(НСтр("ru = '%1 за занятие'"), Формат(ЗаЗанятие, "ЧГ="));
	ИначеЕсли ЗаЧас > 0 Тогда
		ИмяСтавки = СтрШаблон(НСтр("ru = '%1 за час'"), Формат(ЗаЧас, "ЧГ="));
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	ИмяСтавки = Лев(ИмяСтавки, 25);
	Ставка = НайтиПоНаименованиюПервойНастройки(Справочники.УЗ_СтавкиПедагогов, ИмяСтавки);
	Создан = (Ставка = Неопределено);
	Если Создан Тогда
		СтавкаОбъект = Справочники.УЗ_СтавкиПедагогов.СоздатьЭлемент();
		СтавкаОбъект.Наименование = ИмяСтавки;
		Если ЗаЗанятие > 0 Тогда
			СтавкаОбъект.ОплатаЗаЗанятие = ЗаЗанятие;
		Иначе
			СтавкаОбъект.ОплатаЗаЧас = ЗаЧас;
		КонецЕсли;
		СтавкаОбъект.Записать();
		Ставка = СтавкаОбъект.Ссылка;
		ОтметитьПервуюНастройку(Итог, Создан, НСтр("ru = 'ставка педагога'"), ИмяСтавки);
	КонецЕсли;
	Возврат Ставка;

КонецФункции

Процедура ПерваяНастройкаПедагоги(Данные, Итог)

	Для Каждого Строка Из ЗначениеПервойНастройки(Данные, "Педагоги", Новый Массив) Цикл
		ФИО = Лев(СокрЛП(ЗначениеПервойНастройки(Строка, "ФИО", "")), 50);
		Если ФИО = "" Тогда
			Продолжить;
		КонецЕсли;
		Ставка = СтавкаПервойНастройки(ЗначениеПервойНастройки(Строка, "ЗаЗанятие", 0),
			ЗначениеПервойНастройки(Строка, "ЗаЧас", 0), Итог);
		Педагог = НайтиПоНаименованиюПервойНастройки(Справочники.УЗ_ФизЛица, ФИО, Истина);
		Создан = (Педагог = Неопределено);
		Если Создан Или (Ставка <> Неопределено И Не ЗначениеЗаполнено(Педагог.СтавкаПедагога)) Тогда
			ПедагогОбъект = ?(Создан, Справочники.УЗ_ФизЛица.СоздатьЭлемент(), Педагог.ПолучитьОбъект());
			Если Создан Тогда
				ПедагогОбъект.Наименование = ФИО;
				ПедагогОбъект.ЭтоПедагог = Истина;
				ПедагогОбъект.Родитель = Справочники.УЗ_ФизЛица.Педагоги;
			КонецЕсли;
			Если Ставка <> Неопределено Тогда
				ПедагогОбъект.СтавкаПедагога = Ставка;
			КонецЕсли;
			ПедагогОбъект.Записать();
			Педагог = ПедагогОбъект.Ссылка;
		КонецЕсли;
		Итог.Педагоги.Добавить(Педагог);
		ОтметитьПервуюНастройку(Итог, Создан, НСтр("ru = 'педагог'"), ФИО);
	КонецЦикла;

КонецПроцедуры

Функция ТарифПервойНастройки(ИмяТарифа, Сумма, Уроков, Итог)

	Тариф = НайтиПоНаименованиюПервойНастройки(Справочники.УЗ_Тарифы, ИмяТарифа);
	Создан = (Тариф = Неопределено);
	Если Создан Тогда
		ТарифОбъект = Справочники.УЗ_Тарифы.СоздатьЭлемент();
		ТарифОбъект.Наименование = ИмяТарифа;
		ТарифОбъект.Сумма = Сумма;
		ТарифОбъект.КоличествоУроков = Уроков;
		ТарифОбъект.Записать();
		Тариф = ТарифОбъект.Ссылка;
	КонецЕсли;
	ОтметитьПервуюНастройку(Итог, Создан, НСтр("ru = 'тариф'"), ИмяТарифа);
	Возврат Тариф;

КонецФункции

Процедура ПерваяНастройкаТарифы(Данные, Итог)

	ЦенаЗанятия = ЗначениеПервойНастройки(Данные, "ЦенаЗанятия", 0);
	Если ЦенаЗанятия > 0 Тогда
		Итог.ТарифЗанятия = ТарифПервойНастройки(НСтр("ru = 'Разовое занятие'"), ЦенаЗанятия, 1, Итог);
	КонецЕсли;
	Занятий = ЗначениеПервойНастройки(Данные, "АбонементЗанятий", 0);
	ЦенаАбонемента = ЗначениеПервойНастройки(Данные, "ЦенаАбонемента", 0);
	Если Занятий > 0 И ЦенаАбонемента > 0 Тогда
		Итог.ТарифАбонемента = ТарифПервойНастройки(СтрШаблон(НСтр("ru = 'Абонемент %1 занятий'"), Формат(Занятий, "ЧГ=")),
			ЦенаАбонемента, Занятий, Итог);
	КонецЕсли;

КонецПроцедуры

//Группа с расписанием: дни недели из ДниНедели, у каждого дня — общее время начала и окончания.
//Педагог, предмет и тариф группы — первые из помощника (у найденной группы — только если пусты).
Процедура ПерваяНастройкаГруппа(Данные, Итог)

	ИмяГруппы = Лев(СокрЛП(ЗначениеПервойНастройки(Данные, "Группа", "")), 50);
	Если ИмяГруппы = "" Тогда
		Возврат;
	КонецЕсли;
	Педагог = ?(Итог.Педагоги.Количество() > 0, Итог.Педагоги[0], Неопределено);
	Предмет = ?(Итог.Предметы.Количество() > 0, Итог.Предметы[0], Неопределено);
	Тариф = ?(ЗначениеЗаполнено(Итог.ТарифЗанятия), Итог.ТарифЗанятия, Итог.ТарифАбонемента);

	Группа = НайтиПоНаименованиюПервойНастройки(Справочники.УЗ_ГруппыОбучения, ИмяГруппы);
	Создан = (Группа = Неопределено);
	ГруппаОбъект = ?(Создан, Справочники.УЗ_ГруппыОбучения.СоздатьЭлемент(), Группа.ПолучитьОбъект());
	Изменен = Создан;
	Если Создан Тогда
		ГруппаОбъект.Наименование = ИмяГруппы;
		Начало = ЗначениеПервойНастройки(Данные, "ВремяНачала", '00010101');
		Начало = '00010101' + (Начало - НачалоДня(Начало));
		Длительность = ЗначениеПервойНастройки(Данные, "Продолжительность", '00010101010000');
		Длительность = '00010101' + (Длительность - НачалоДня(Длительность));
		Окончание = Начало + (Длительность - '00010101');
		ГруппаОбъект.Время = Начало;
		ГруппаОбъект.ВремяОкончания = Окончание;
		ГруппаОбъект.Продолжительность = Длительность;
		Дни = ВРег(СтрЗаменить(ЗначениеПервойНастройки(Данные, "ДниНедели", ""), " ", ""));
		Для Каждого КодДня Из СтрРазделить(Дни, ",;", Ложь) Цикл
			Если СтрРазделить("ПН,ВТ,СР,ЧТ,ПТ,СБ,ВС", ",").Найти(КодДня) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ГруппаОбъект[КодДня] = Истина;
			ГруппаОбъект[КодДня + "Время"] = Начало;
			ГруппаОбъект[КодДня + "Время2"] = Окончание;
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(Педагог) И Не ЗначениеЗаполнено(ГруппаОбъект.Педагог) Тогда
		ГруппаОбъект.Педагог = Педагог;
		Изменен = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(Предмет) И Не ЗначениеЗаполнено(ГруппаОбъект.ПредметОбучения) Тогда
		ГруппаОбъект.ПредметОбучения = Предмет;
		Изменен = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(Тариф) И Не ЗначениеЗаполнено(ГруппаОбъект.Тариф) Тогда
		ГруппаОбъект.Тариф = Тариф;
		Изменен = Истина;
	КонецЕсли;
	Если Изменен Тогда
		ГруппаОбъект.Записать();
	КонецЕсли;
	Итог.Группа = ГруппаОбъект.Ссылка;
	ОтметитьПервуюНастройку(Итог, Создан, НСтр("ru = 'группа'"), ИмяГруппы);

КонецПроцедуры

//Родитель ученика — человек из папки «Родители» (ищется по ФИО среди не педагогов).
Функция РодительПервойНастройки(ФИО, Итог)

	Родитель = НайтиПоНаименованиюПервойНастройки(Справочники.УЗ_ФизЛица, ФИО, Ложь);
	Создан = (Родитель = Неопределено);
	Если Создан Тогда
		РодительОбъект = Справочники.УЗ_ФизЛица.СоздатьЭлемент();
		РодительОбъект.Наименование = ФИО;
		РодительОбъект.Родитель = Справочники.УЗ_ФизЛица.Родители;
		РодительОбъект.Записать();
		Родитель = РодительОбъект.Ссылка;
	КонецЕсли;
	ОтметитьПервуюНастройку(Итог, Создан, НСтр("ru = 'родитель'"), ФИО);
	Возврат Родитель;

КонецФункции

//Ученики: папка «Ученики», телефон, родитель; с группой помощника — строка на вкладке «Группы обучения»
//(по ней помощник создания уроков заполняет учеников группы).
Процедура ПерваяНастройкаУченики(Данные, Итог)

	Для Каждого Строка Из ЗначениеПервойНастройки(Данные, "Ученики", Новый Массив) Цикл
		ФИО = Лев(СокрЛП(ЗначениеПервойНастройки(Строка, "ФИО", "")), 50);
		Если ФИО = "" Тогда
			Продолжить;
		КонецЕсли;
		Телефон = СокрЛП(ЗначениеПервойНастройки(Строка, "Телефон", ""));
		ФИОРодителя = Лев(СокрЛП(ЗначениеПервойНастройки(Строка, "Родитель", "")), 50);
		Родитель = ?(ФИОРодителя = "", Неопределено, РодительПервойНастройки(ФИОРодителя, Итог));

		Ученик = НайтиПоНаименованиюПервойНастройки(Справочники.УЗ_ФизЛица, ФИО, Ложь);
		Создан = (Ученик = Неопределено);
		УченикОбъект = ?(Создан, Справочники.УЗ_ФизЛица.СоздатьЭлемент(), Ученик.ПолучитьОбъект());
		Изменен = Создан;
		Если Создан Тогда
			УченикОбъект.Наименование = ФИО;
			УченикОбъект.Родитель = Справочники.УЗ_ФизЛица.Ученики;
		КонецЕсли;
		Если Телефон <> "" И Не ЗначениеЗаполнено(УченикОбъект.Телефон) Тогда
			УченикОбъект.Телефон = Телефон;
			Изменен = Истина;
		КонецЕсли;
		Если Родитель <> Неопределено И Не ЗначениеЗаполнено(УченикОбъект.Родитель1) Тогда
			УченикОбъект.Родитель1 = Родитель;
			Изменен = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(Итог.Группа) И УченикОбъект.ГруппыОбучения.Найти(Итог.Группа, "ГруппаОбучения") = Неопределено Тогда
			УченикОбъект.ГруппыОбучения.Добавить().ГруппаОбучения = Итог.Группа;
			Изменен = Истина;
		КонецЕсли;
		Если Изменен Тогда
			УченикОбъект.Записать();
		КонецЕсли;
		Итог.Ученики.Добавить(УченикОбъект.Ссылка);
		ОтметитьПервуюНастройку(Итог, Создан, НСтр("ru = 'ученик'"), ФИО);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
